Revit 2027 API
PartMakerMethodToDivideVolumes.ProfileMatch Property
 Determines how two profiles match.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PartEdgeConditionOrientation ProfileMatch { get; set; }
Public Property ProfileMatch As PartEdgeConditionOrientation
	Get
	Set
public:
property PartEdgeConditionOrientation ProfileMatch {
	PartEdgeConditionOrientation get ();
	void set (PartEdgeConditionOrientation value);
}
member ProfileMatch : PartEdgeConditionOrientation with get, set
Property Value
PartEdgeConditionOrientation
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace